app/Http/Controllers/EmployeeController.php

select * from `env_employees` where `id` = '60' limit 1
update `env_employees` set `last_name` = 'Dela Cru', `first_name` = 'Ne', `position` = 'Manufacturin', `gender` = 'Female', `contact_number` = '09956338156', `env_employees`.`updated_at` = '2021-02-15 14:51:52' where `id` = 60
---
    public function update(Request $request, $id)
    {
        try {
            $employee = Employee::where('id', $id)->first();
            // $imagePath = request('profile_picture');
            // if(request('profile_picture')){
            //     $imagePath = request('profile_picture')->store('uploads', 'public');
            //     $employee->profile_picture = $imagePath;
            // }
            $employee->last_name = $request->input('last_name');
            $employee->first_name = $request->input('first_name');
            $employee->position = $request->input('position');
            $employee->gender = $request->input('gender');
            $employee->contact_number = $request->input('contact_number');

            // if(!($request->input('active_status')==null)){
            //     $employee->active_status = $request->input('active_status');
            // }
            $employee->save();

select * from `env_employees` where `id` = '62' limit 1
update `env_employees` set `profile_picture` = 'uploads/ws6LUUSKONQVkRpIEg3IUXxB5JqgdA70YCL2dZCi.jpg', `env_employees`.`updated_at` = '2021-02-16 04:56:18' where `id` = 62
---
    public function updateimage(Request $request, $id)
    {
        try {
            $employee = Employee::where('id', $id)->first();
            $file = $request->hasFile('profile_picture');
            // $imagePath = request('profile_picture')->store('uploads', 'public');
            if($request->hasFile('profile_picture')){
                $imagePath = request('profile_picture')->store('uploads', 'public');
                $employee->profile_picture = $imagePath;
            }
            $employee->save();